#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rockset-community/community/runs/run-hPaF5rfZE9Q4sLF7

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
rockset_s3_integration.public: Refreshing state... [id=rockset-public-collections]
rockset_workspace.community: Refreshing state... [id=community]
rockset_kafka_integration.confluent: Refreshing state... [id=confluent-cloud]
rockset_role.query-only: Refreshing state... [id=query-only]
rockset_kafka_collection.orders: Refreshing state... [id=community.orders]
rockset_api_key.query-only: Refreshing state... [id=query-only]
rockset_s3_collection.cities: Refreshing state... [id=community.cities]
rockset_alias.production: Refreshing state... [id=community.production]
rockset_view.state[0]: Refreshing state... [id=community.state_24]
rockset_view.state[1]: Refreshing state... [id=community.state_42]
rockset_view.state[2]: Refreshing state... [id=community.state_49]
rockset_query_lambda.orders-summary: Refreshing state... [id=community.orders-summary]
rockset_query_lambda_tag.production: Refreshing state... [id=community.orders-summary.production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # rockset_kafka_integration.confluent will be updated in-place
  ~ resource "rockset_kafka_integration" "confluent" {
        id                   = "confluent-cloud"
      + kafka_data_format    = ""
        name                 = "confluent-cloud"
      ~ security_config      = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "secret"  = (sensitive)
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # rockset_query_lambda.cities-by-country will be created
  + resource "rockset_query_lambda" "cities-by-country" {
      + description = "created by Rockset terraform provider"
      + id          = (known after apply)
      + name        = "cities-by-country"
      + state       = (known after apply)
      + version     = (known after apply)
      + workspace   = "community"

      + sql {
          + query = <<-EOT
                SELECT
                    c.fields.country,
                    count(c.fields.name) as cities
                FROM
                    community.cities as c
                GROUP BY
                    country
                ORDER by
                    cities DESC
            EOT
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @pmenglund, Action: `pull_request`*